app/controllers/marques_controller.rb

  def index
    @marques = Marque.all
---
SELECT "marques".* FROM "marques"

  def create
    @marque = Marque.new(marque_params)
    if @marque.save
---
INSERT INTO "marques" ("nom", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nom", "Brüel & Kjaer"], ["created_at", 2017-03-30 14:42:49 UTC], ["updated_at", 2017-03-30 14:42:49 UTC]]

    def set_marque
      @marque = Marque.find(params[:id])
---
SELECT  "marques".* FROM "marques" WHERE "marques"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]